<h1 align='center'> KNN Imputer</h1>

In [48]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [49]:
df = pd.read_csv('titanic_train.csv')[['Age','Pclass','Fare','Survived']]

In [50]:
df.head()

    Age  Pclass     Fare  Survived
0  22.0       3   7.2500         0
1  38.0       1  71.2833         1
2  26.0       3   7.9250         1
3  35.0       1  53.1000         1
4  35.0       3   8.0500         0

In [51]:
df.isnull().sum()

Age         177
Pclass        0
Fare          0
Survived      0
dtype: int64

### Train Test Split

In [52]:
X= df.drop(columns='Survived')
y= df['Survived']

In [53]:
X

      Age  Pclass     Fare
0    22.0       3   7.2500
1    38.0       1  71.2833
2    26.0       3   7.9250
3    35.0       1  53.1000
4    35.0       3   8.0500
..    ...     ...      ...
886  27.0       2  13.0000
887  19.0       1  30.0000
888   NaN       3  23.4500
889  26.0       1  30.0000
890  32.0       3   7.7500

[891 rows x 3 columns]

In [54]:
from sklearn.model_selection import train_test_split

In [55]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

In [56]:
X_train.shape, X_test.shape

((596, 3), (295, 3))

### KNN Imputer

In [57]:
from sklearn.impute import KNNImputer

In [58]:
knn= KNNImputer(n_neighbors=10)

In [59]:
X_train_transform= knn.fit_transform(X_train)
X_test_transform= knn.transform(X_test)

In [60]:
pd.DataFrame(X_train_transform,columns=X_train.columns)

       Age  Pclass      Fare
0    54.00     1.0   51.8625
1    24.80     3.0   15.5000
2    25.00     2.0   41.5792
3    26.00     3.0   14.4542
4    22.00     3.0   10.5167
..     ...     ...       ...
591  21.00     3.0    7.6500
592  38.35     1.0   31.0000
593  41.00     3.0   14.1083
594  14.00     1.0  120.0000
595  21.00     1.0   77.2875

[596 rows x 3 columns]

### Model Training

In [61]:
from sklearn.linear_model import LogisticRegression

In [62]:
lr = LogisticRegression()

In [63]:
lr.fit(X_train_transform,y_train)

y_pred=lr.predict(X_test_transform)

### Performance metric

In [64]:
from sklearn.metrics import accuracy_score

In [65]:
accuracy_score(y_test,y_pred)

0.7254237288135593

### Simple Imputer

In [66]:
from sklearn.impute import SimpleImputer

In [67]:
si = SimpleImputer()
X_train_transform1= si.fit_transform(X_train)
X_test_transform1= si.transform(X_test)

In [68]:
lr = LogisticRegression()

In [69]:
lr.fit(X_train_transform1,y_train)
y_pred = lr.predict(X_test_transform)

accuracy_score(y_test,y_pred)

0.7186440677966102